app/controllers/sessions_controller.rb

 def create
   @user = User.find_by(email: params.fetch("email_from_query"))
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rabbou@uchicago.edu"], ["LIMIT", 1]]