app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.all.order({ :created_at => :desc })

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest", "role") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new
    @user.email = params.fetch("email_from_query")
    @user.password = params.fetch("password_from_query")
    @user.role = "basic"
    session[:user_id] = @user.id

    if @user.valid?
      @user.save